# LoadareaRecovered Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoomFailures..::..LoadareaRecovered Property
BuiltInFailures..::..RoomFailures Class See Also
---
The boundary encloses the region for area based load:[Areabasedload].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LoadareaRecovered { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LoadareaRecovered As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LoadareaRecovered {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RoomFailures Class
Autodesk.Revit.DB Namespace